/**
 * 
 * rule 自定义的基本格式
 * 关于计算规则和predicate规则的关联。如果是谓语规则，则规则有bases字段。譬如，/用地限定条件/容积率是一个predicated规则，它的bases对象是设计/容积率。pdc中计算时，传入predicat规则，如果不满足就退出计算，并记录完成计算原因
 * 
 * DSL描述：
 * 
 * name:"江苏嘉城/成本/项目总成本"
 * bases:"1:江苏嘉城/成本/开发成本|2:江苏嘉城/成本/期间费用|3:江苏嘉城/成本/不含税费总投资|4:江苏嘉城/成本/开发期间税费|5:江苏嘉城/成本/返还费用",
 * formula:"_1 + _2 + _3 + _4 - abs(_5)"，
 * $protocol：“W" //default="L","W"网络服务
 * iValue:50  //如果有迭代依赖，指定初始值，不指定默认为0；
 * constraintCondition:/限定条件对象 //如果有迭代指定迭代退出条件
 * markdown:""
 */

/**
 * 
 * 因为规则很多，原型链需要通过Category细分为costrule，projectrule，当修改某一规则时，只是写时copy本类型的accesor中的item。
 */

var costRules = [
    //成本
    {
        name: "江苏嘉城/成本/项目总成本",
        bases: "1:江苏嘉城/成本/开发成本|2:江苏嘉城/成本/期间费用|3:江苏嘉城/成本/不含税费总投资|4:江苏嘉城/成本/开发期间税费|5:江苏嘉城/成本/返还费用",
        formula: "_1 + _2 + _3 + _4 - Math.abs(_5)",
        iValue: 50,
    },




];
//项目
var projectRules = [{
        name: "江苏嘉城/项目/项目名称",
        formula: "‘xxx.xxx’+(new Date()).toLocaleString()",
    },
    {
        name: "江苏嘉城/项目/用地限定条件/地块地址/省",
        formula: "‘江苏省’",
    },
    {
        name: "江苏嘉城/项目/用地限定条件/地块地址/市",
        formula: "‘南京市’",
    },
    {
        name: "江苏嘉城/项目/用地限定条件/地块地址/区县",
        formula: "‘’",

    },
    {
        name: "江苏嘉城/项目/用地限定条件/地块地址/详细地址",
        formula: "‘’",

    },

    {
        name: "江苏嘉城/项目/用地限定条件/地块编号",
        formula: "‘’",

    },
    {
        name: "江苏嘉城/项目/用地限定条件/总用地面积", //没有formula的，计算前必须要给定
        bases: "1:江苏嘉城/项目/用地限定条件/规划建设用地面积|2:江苏嘉城/项目/用地限定条件/代征绿地面积|3:江苏嘉城/项目/用地限定条件/代征道路面积",
        formula: "_1+_2+_3",
        markdown: "单位:公顷"
    },
    {
        name: "江苏嘉城/项目/用地限定条件/规划建设用地面积", //没有formula的，计算前必须要给定
        bases: "",
        markdown: "单位:公顷"
    },
    {
        name: "江苏嘉城/项目/用地限定条件/代征绿地面积",
        bases: "",
        markdown: "单位:公顷"
    },
    {
        name: "江苏嘉城/项目/用地限定条件/代征道路面积", //没有formula的，计算前必须要给定
        bases: "",
        markdown: "单位:公顷"
    },
    {
        name: "江苏嘉城/项目/用地限定条件/建筑密度", //没有formula的，计算前必须要给定
        bases: "",
        markdown: "单位:%"
    },
    {
        name: "江苏嘉城/项目/用地限定条件/容积率",
        markdown: ""
    },
    {
        name: "江苏嘉城/项目/用地限定条件/建筑退道路红线距离", //没有formula的，计算前必须要给定
        bases: "",
        markdown: "单位:米"
    },
    {
        name: "江苏嘉城/项目/用地限定条件/建筑退用地界线距离",
        bases: "",
        markdown: "单位:米"
    },
    {
        name: "江苏嘉城/项目/用地限定条件/建筑高度", //没有formula的，计算前必须要给定
        bases: "",
        markdown: "单位:米"
    },
    {
        name: "江苏嘉城/项目/用地限定条件/绿化率", //没有formula的，计算前必须要给定
        bases: "",
        markdown: "单位:%"
    },
    {
        name: "江苏嘉城/项目/用地限定条件/公建配套设施建设要求/物管用房/用地面积",
        bases: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/项目/用地限定条件/公建配套设施建设要求/物管用房/配建数量",
        bases: "",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/项目/用地限定条件/公建配套设施建设要求/物管用房/配建建筑面积",
        bases: "",
        markdown: "单位:平方米"
    },



];
//财务
var financeRules = [{
        name: "江苏嘉城/财务/土地指标/土地出让金",
        bases: "1:江苏嘉城/成本/土地出让总价2:江苏嘉城/项目/土地面积",
        formula: "_1/(_2*15)", //一公顷= 15亩
        markdown: "'单位:万元/亩|=土地总价/总建设用地限定条件面积(亩)|土地挂牌价格折合到建设用地限定条件每亩土地价格'"
    },
    {
        name: "江苏嘉城/财务/土地指标/楼面地价",
        bases: "1:江苏嘉城/成本/土地出让总价|2:江苏嘉城/设计/总计容面积",
        formula: "_1/_2",
        markdown: "'单位:元/平方米'"
    },
    {
        name: "江苏嘉城/财务/土地指标/付现土地成本",
        bases: "",
        formula: "",
        markdown: "'单位:万元|土地出让金、契税、四源建设费、土地租赁费等可计入土地成本费用'"
    },
    {
        name: "江苏嘉城/财务/投资指标/项目总投资",
        bases: "",
        formula: "0",
        markdown: "'单位:万元|=土地征用及拆迁补偿费+前期工程费+建筑安装工程费+基础设施费+公共配套设施建设费+开发间接费+不可预见费+管理费+销售费+财务费+营业税及附加+土地增值税+所得税'"
    },
    {
        name: "江苏嘉城/财务/投资指标/项目建设周期",
        bases: "",
        formula: "",
        markdown: "单位:年|自土地获取之日至项目竣工备案达到交房标准"

    },
    {
        name: "江苏嘉城/财务/投资指标/销售物业总投资",
        bases: "",
        formula: "",
        markdown: "单位:万元|即销售部分总投资，全投资概念包含相关税费"

    },
    {
        name: "江苏嘉城/财务/投资指标/销售物业建设单方成本",
        bases: "",
        formula: "",
        markdown: "单位:元/平方米|=销售物业建设成本/销售全建筑面积"

    },
    {
        name: "江苏嘉城/财务/投资指标/销售物业可售单方成本",
        bases: "",
        formula: "",
        markdown: '"单位:元/平方米|=销售物业建设成本/销售中可售建筑面积"'
    },
    {
        name: "江苏嘉城/财务/投资指标/经营物业总投资",
        bases: "",
        formula: "",
        markdown: '"单位:万元"'
    },
    //
    {
        name: "江苏嘉城/财务/财务与收益指标/销售收入",
        bases: "",
        formula: "",
        markdown: '"单位:万元"'
    },
    {
        name: "江苏嘉城/财务/财务与收益指标/销售周期",
        bases: "",
        formula: "",
        markdown: '"单位:年|项目开盘日至项目售罄日'

    },
    {
        name: "江苏嘉城/财务/财务与收益指标/销售毛利润总额",
        bases: "",
        formula: "",
        markdown: '"单位:万元|=销售收入-直接开发成本"'
    },
    {
        name: "江苏嘉城/财务/财务与收益指标/销售净利润总额",
        bases: "",
        formula: "",
        markdown: '"单位:万元|=销售毛利润-期间费用-相关税费"'
    },
    {
        name: "江苏嘉城/财务/财务与收益指标/销售毛利率",
        bases: "",
        formula: "",
        markdown: '"单位:%"'
    },
    {
        name: "江苏嘉城/财务/财务与收益指标/销售净利率",
        bases: "",
        formula: "",
        markdown: '"单位:%"'
    },
    {
        name: "江苏嘉城/财务/财务与收益指标/投资收益率",
        bases: "",
        formula: "",
        markdown: '"单位:%|=净利润/项目总成本"'
    },
    {
        name: "江苏嘉城/财务/财务与收益指标/自有资金",
        bases: "",
        formula: "",
        markdown: '"单位:万元|注册资本金+股东借款"'
    },
    {
        name: "江苏嘉城/财务/财务与收益指标/自有资金收益率",
        bases: "",
        formula: "",
        markdown: '"单位:%|=销售净利润/自有资金/销售周期"'
    },
    {
        name: "江苏嘉城/财务/财务与收益指标/净资产收益率",
        bases: "",
        formula: "",
        markdown: '"单位:%"'
    },
    {
        name: "江苏嘉城/财务/财务与收益指标/项目资金平衡缺口",
        bases: "",
        formula: "",
        markdown: '"单位:万元|=所有者权益-资产"'
    },
    {
        name: "江苏嘉城/财务/财务与收益指标/全投资IRR",
        bases: "",
        formula: "",
        markdown: '""'
    },
    {
        name: "江苏嘉城/财务/财务与收益指标/全投资财务净现值",
        bases: "",
        formula: "",
        markdown: '""'
    },
    {
        name: "江苏嘉城/财务/财务与收益指标/自有资金IRR",
        bases: "",
        formula: "",
        markdown: '""'
    },
    {
        name: "江苏嘉城/财务/财务与收益指标/自有资金财务净现值",
        bases: "",
        formula: "",
        markdown: '""'
    },
    {
        name: "江苏嘉城/财务/财务与收益指标/自有资金财务净现值",
        bases: "",
        formula: "",
        markdown: '""'
    },
    {
        name: "江苏嘉城/财务/财务与收益指标/年折现率",
        bases: "",
        formula: "",
        markdown: '""'
    },
    {
        name: "江苏嘉城/财务/财务与收益指标/项目投资回收期",
        bases: "",
        formula: "",
        markdown: '""'
    },
    {
        name: "江苏嘉城/财务/财务与收益指标/杠杆率",
        bases: "",
        formula: "",
        markdown: '""'
    },
    {
        name: "江苏嘉城/财务/财务与收益指标/资产负债率",
        bases: "",
        formula: "",
        markdown: '""'
    }
];
//设计
var designRules_设计 = [

    {
        name: "江苏嘉城/设计/产品/占地面积",
        bases: "1:江苏嘉城/设计/产品/住宅/占地面积|2:江苏嘉城/设计/产品/经营性物业/占地面积|3:江苏嘉城/设计/产品/配套设施/占地面积|4:江苏嘉城/设计/产品/停车设施/占地面积",
        formula: "_1+_2+_3+_4",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/电梯台数",
        bases: "1:江苏嘉城/设计/产品/住宅/电梯台数|2:江苏嘉城/设计/产品/经营性物业/电梯台数|3:江苏嘉城/设计/产品/配套设施/电梯台数",
        formula: "_1+_2+_3",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/建筑面积",
        bases: "1:江苏嘉城/设计/产品/住宅/建筑面积|2:江苏嘉城/设计/产品/经营性物业/建筑面积|3:江苏嘉城/设计/产品/配套设施/建筑面积|4:江苏嘉城/设计/产品/停车设施/建筑面积",
        formula: "_1+_2+_3+_4",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/建造面积",
        bases: "1:江苏嘉城/设计/产品/住宅/建造面积|2:江苏嘉城/设计/产品/经营性物业/建造面积|3:江苏嘉城/设计/产品/配套设施/建造面积|4:江苏嘉城/设计/产品/停车设施/建造面积",
        formula: "_1+_2+_3+_4",
        markdown: "单位:平方米"
    },

    {
        name: "江苏嘉城/设计/产品/可售面积",
        bases: "1:江苏嘉城/设计/产品/住宅/可售面积|2:江苏嘉城/设计/产品/经营性物业/可售面积|3:江苏嘉城/设计/产品/配套设施/可售面积|4:江苏嘉城/设计/产品/停车设施/可售面积",
        formula: "_1+_2+_3+_4",
        markdown: "单位:平方米"
    },
];
var designRules_住宅 = [
    //住宅
    //多层住宅
    {
        name: "江苏嘉城/设计/产品/住宅/占地面积",
        bases: "1:江苏嘉城/设计/产品/住宅/多层住宅/占地面积|2:江苏嘉城/设计/产品/住宅/小高层住宅/占地面积|3:江苏嘉城/设计/产品/住宅/高层住宅/占地面积|4:江苏嘉城/设计/产品/住宅/合院住宅/占地面积|5:江苏嘉城/设计/产品/住宅/情景花园/占地面积",
        formula: "_1+_2+_3+_4+_5",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/电梯台数",
        bases: "1:江苏嘉城/设计/产品/住宅/多层住宅/电梯台数|2:江苏嘉城/设计/产品/住宅/小高层住宅/电梯台数|3:江苏嘉城/设计/产品/住宅/高层住宅/电梯台数|4:江苏嘉城/设计/产品/住宅/合院住宅/电梯台数|5:江苏嘉城/设计/产品/住宅/情景花园/电梯台数",
        formula: "_1+_2+_3+_4+_5",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/建筑面积",
        bases: "1:江苏嘉城/设计/产品/住宅/多层住宅/建筑面积|2:江苏嘉城/设计/产品/住宅/小高层住宅/建筑面积|3:江苏嘉城/设计/产品/住宅/高层住宅/建筑面积|4:江苏嘉城/设计/产品/住宅/合院住宅/建筑面积|5:江苏嘉城/设计/产品/住宅/情景花园/建筑面积",
        formula: "_1+_2+_3+_4+_5",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/建造面积",
        bases: "1:江苏嘉城/设计/产品/住宅/多层住宅/建造面积|2:江苏嘉城/设计/产品/住宅/小高层住宅/建造面积|3:江苏嘉城/设计/产品/住宅/高层住宅/建造面积|4:江苏嘉城/设计/产品/住宅/合院住宅/建造面积|5:江苏嘉城/设计/产品/住宅/情景花园/建造面积",
        formula: "_1+_2+_3+_4+_5",
        markdown: "单位:平方米"
    },

    {
        name: "江苏嘉城/设计/产品/住宅/可售面积",
        bases: "1:江苏嘉城/设计/产品/住宅/多层住宅/可售面积|2:江苏嘉城/设计/产品/住宅/小高层住宅/可售面积|3:江苏嘉城/设计/产品/住宅/高层住宅/可售面积|4:江苏嘉城/设计/产品/住宅/合院住宅/可售面积|5:江苏嘉城/设计/产品/住宅/情景花园/可售面积",
        formula: "_1+_2+_3+_4+_5",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/单元数",
        bases: "1:江苏嘉城/设计/产品/住宅/多层住宅/单元数|2:江苏嘉城/设计/产品/住宅/小高层住宅/单元数|3:江苏嘉城/设计/产品/住宅/高层住宅/单元数|4:江苏嘉城/设计/产品/住宅/合院住宅/单元数|5:江苏嘉城/设计/产品/住宅/情景花园/单元数",
        formula: "_1+_2+_3+_4+_5",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/户数",
        bases: "1:江苏嘉城/设计/产品/住宅/多层住宅/户数|2:江苏嘉城/设计/产品/住宅/小高层住宅/户数|3:江苏嘉城/设计/产品/住宅/高层住宅/户数|4:江苏嘉城/设计/产品/住宅/合院住宅/户数|5:江苏嘉城/设计/产品/住宅/情景花园/户数",
        formula: "_1+_2+_3+_4+_5",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/层数",
        bases: "1:江苏嘉城/设计/产品/住宅/多层住宅/层数|2:江苏嘉城/设计/产品/住宅/小高层住宅/层数|3:江苏嘉城/设计/产品/住宅/高层住宅/层数|4:江苏嘉城/设计/产品/住宅/合院住宅/层数|5:江苏嘉城/设计/产品/住宅/情景花园/层数",
        formula: "_1+_2+_3+_4+5",
        markdown: "单位:层"
    },

    //多层住宅
    {
        name: "江苏嘉城/设计/产品/住宅/多层住宅/占地面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/多层住宅/电梯台数",
        formula: "",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/多层住宅/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/多层住宅/建造面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/多层住宅/可售面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/多层住宅/平均每户面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/多层住宅/单元数",
        formula: "",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/多层住宅/户数",
        formula: "",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/多层住宅/层数",
        formula: "",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/多层住宅/层高",
        formula: "",
        markdown: "单位:米"
    },
    //小高层住宅
    {
        name: "江苏嘉城/设计/产品/住宅/小高层住宅/占地面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/小高层住宅/电梯台数",
        formula: "",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/小高层/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/小高层住宅/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/小高层住宅/可售面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/小高层住宅/平均每户面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/小高层住宅/单元数",
        formula: "",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/小高层住宅/户数",
        formula: "",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/小高层住宅/层数",
        formula: "",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/小高层住宅/层高",
        formula: "",
        markdown: "单位:米"
    },

    //高层住宅
    {
        name: "江苏嘉城/设计/产品/住宅/高层住宅/占地面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/高层住宅/电梯台数",
        formula: "",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/高层住宅/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/高层住宅/建造面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/高层住宅/可售面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/高层住宅/平均每户面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/高层住宅/单元数",
        formula: "",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/高层住宅/户数",
        formula: "",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/高层住宅/层数",
        formula: "",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/高层住宅/层高",
        formula: "",
        markdown: "单位:米"
    },

    //合院住宅
    {
        name: "江苏嘉城/设计/产品/住宅/合院住宅/占地面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/合院住宅/电梯台数",
        formula: "",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/合院住宅/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/多层住宅/建造面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/合院住宅/可售面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/合院住宅/平均每户面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/合院住宅/单元数",
        formula: "",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/合院住宅/户数",
        formula: "",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/合院住宅/层数",
        formula: "",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/合院住宅/层高",
        formula: "",
        markdown: "单位:米"
    },
    //情景花园
    {
        name: "江苏嘉城/设计/产品/住宅/情景花园/占地面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/情景花园/电梯台数",
        formula: "",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/情景花园/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/多层住宅/建造面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/情景花园/可售面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/情景花园/平均每户面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/情景花园/单元数",
        formula: "",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/情景花园/户数",
        formula: "",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/情景花园/层数",
        formula: "",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/设计/产品/住宅/情景花园/层高",
        formula: "",
        markdown: "单位:米"
    },


];
var designRules_经营性物业 = [
    //经营性物业

    {
        name: "江苏嘉城/设计/产品/经营性物业/占地面积",
        bases: "1:江苏嘉城/设计/产品/经营性物业/集中商业/占地面积|2:江苏嘉城/设计/产品/经营性物业/分散商业/占地面积",
        formula: "_1+_2",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/电梯台数",
        bases: "1:江苏嘉城/设计/产品/经营性物业/集中商业/电梯台数|2:江苏嘉城/设计/产品/经营性物业/分散商业/电梯台数",
        formula: "_1+_2",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/建筑面积",
        bases: "1:江苏嘉城/设计/产品/经营性物业/集中商业/建筑面积|2:江苏嘉城/设计/产品/经营性物业/分散商业/建筑面积",
        formula: "_1+_2",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/建造面积",
        bases: "1:江苏嘉城/设计/产品/经营性物业/集中商业/建造面积|2:江苏嘉城/设计/产品/经营性物业/分散商业/建造面积",
        formula: "_1+_2",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/可售面积",
        bases: "1:江苏嘉城/设计/产品/经营性物业/集中商业/可售面积|2:江苏嘉城/设计/产品/经营性物业/分散商业/可售面积",
        formula: "_1+_2",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/单元数",
        bases: "1:江苏嘉城/设计/产品/经营性物业/集中商业/单元数|2:江苏嘉城/设计/产品/经营性物业/分散商业/单元数",
        formula: "_1+_2",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/户数",
        bases: "1:江苏嘉城/设计/产品/经营性物业/集中商业/户数|2:江苏嘉城/设计/产品/经营性物业/分散商业/户数",
        formula: "_1+_2",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/层数",
        bases: "1:江苏嘉城/设计/产品/经营性物业/集中商业/层数|2:江苏嘉城/设计/产品/经营性物业/分散商业/层数",
        formula: "_1+_2",
        markdown: "单位:层"
    },

    //集中商业
    {
        name: "江苏嘉城/设计/产品/经营性物业/集中商业/占地面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/集中商业/电梯台数",
        formula: "",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/集中商业/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/集中商业/建造面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/集中商业/可售面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/集中商业/平均每户面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/集中商业/单元数",
        formula: "",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/集中商业/户数",
        formula: "",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/集中商业/层数",
        formula: "",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/集中商业/层高",
        formula: "",
        markdown: "单位:米"
    },
    //分散商业
    {
        name: "江苏嘉城/设计/产品/经营性物业/分散商业/占地面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/分散商业/电梯台数",
        formula: "",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/分散商业/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/分散商业/建造面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/分散商业/可售面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/分散商业/平均每户面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/分散商业/单元数",
        formula: "",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/分散商业/户数",
        formula: "",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/分散商业/层数",
        formula: "",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/设计/产品/经营性物业/分散商业/层高",
        formula: "",
        markdown: "单位:米"
    },
];
var designRules_配套设施 = [
    //配套设施
    {
        name: "江苏嘉城/设计/产品/配套设施/占地面积",
        bases: "1:江苏嘉城/设计/产品/配套设施/幼儿园/占地面积|2:江苏嘉城/设计/产品/配套设施/会所/占地面积|3:江苏嘉城/设计/产品/配套设施/物业用房/占地面积|4:江苏嘉城/设计/产品/配套设施/市政公用/占地面积|5:江苏嘉城/设计/产品/配套设施/小学/占地面积",
        formula: "_1+_2+_3+_4+_5",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/电梯台数",
        bases: "1:江苏嘉城/设计/产品/配套设施/幼儿园/电梯台数|2:江苏嘉城/设计/产品/配套设施/会所/电梯台数|3:江苏嘉城/设计/产品/配套设施/物业用房/电梯台数|4:江苏嘉城/设计/产品/配套设施/市政公用/电梯台数|5:江苏嘉城/设计/产品/配套设施/小学/电梯台数",
        formula: "_1+_2+_3+_4+_5",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/建筑面积",
        bases: "1:江苏嘉城/设计/产品/配套设施/幼儿园/建筑面积|2:江苏嘉城/设计/产品/配套设施/会所/建筑面积|3:江苏嘉城/设计/产品/配套设施/物业用房/建筑面积|4:江苏嘉城/设计/产品/配套设施/市政公用/建筑面积|5:江苏嘉城/设计/产品/配套设施/小学/建筑面积",
        formula: "_1+_2+_3+_4+_5",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/建造面积",
        bases: "1:江苏嘉城/设计/产品/配套设施/幼儿园/建造面积|2:江苏嘉城/设计/产品/配套设施/会所/建造面积|3:江苏嘉城/设计/产品/配套设施/物业用房/建造面积|4:江苏嘉城/设计/产品/配套设施/市政公用/建造面积|5:江苏嘉城/设计/产品/配套设施/小学/建造面积",
        formula: "_1+_2+_3+_4+_5",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/可售面积",
        bases: "1:江苏嘉城/设计/产品/配套设施/幼儿园/可售面积|2:江苏嘉城/设计/产品/配套设施/会所/可售面积|3:江苏嘉城/设计/产品/配套设施/物业用房/可售面积|4:江苏嘉城/设计/产品/配套设施/市政公用/可售面积|5:江苏嘉城/设计/产品/配套设施/小学/可售面积",
        formula: "_1+_2+_3+_4+_5",
        markdown: "单位:平方米"
    },

    //幼儿园
    {
        name: "江苏嘉城/设计/产品/配套设施/幼儿园/占地面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/幼儿园/电梯台数",
        formula: "",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/幼儿园/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/幼儿园/建造面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/幼儿园/可售面积",
        formula: "",
        markdown: "单位:平方米"
    },

    //会所
    {
        name: "江苏嘉城/设计/产品/配套设施/会所/占地面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/会所/电梯台数",
        formula: "",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/会所/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/会所/建造面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/会所/可售面积",
        formula: "",
        markdown: "单位:平方米"
    },

    //物业用房
    {
        name: "江苏嘉城/设计/产品/配套设施/物业用房/占地面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/物业用房/电梯台数",
        formula: "",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/物业用房/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/物业用房/建造面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/物业用房/可售面积",
        formula: "",
        markdown: "单位:平方米"
    },

    //市政公用
    {
        name: "江苏嘉城/设计/产品/配套设施/市政公用/占地面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/市政公用/电梯台数",
        formula: "",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/市政公用/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/市政公用/建造面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/市政公用/可售面积",
        formula: "",
        markdown: "单位:平方米"
    },

    //小学
    {
        name: "江苏嘉城/设计/产品/配套设施/小学/占地面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/小学/电梯台数",
        formula: "",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/小学/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/小学/建造面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/配套设施/小学/可售面积",
        formula: "",
        markdown: "单位:平方米"
    },

];
var designRules_停车设施 = [
    //配套设施
    {
        name: "江苏嘉城/设计/产品/停车设施/占地面积",
        bases: "1:江苏嘉城/设计/产品/停车设施/架空停车楼/占地面积|2:江苏嘉城/设计/产品/停车设施/架空花园/占地面积|3:江苏嘉城/设计/产品/停车设施/架空车库/占地面积|4:江苏嘉城/设计/产品/停车设施/地下车位(非人防)/占地面积|5:江苏嘉城/设计/产品/停车设施/地下车位(人防)/占地面积|6:江苏嘉城/设计/产品/停车设施/地面露天停车/占地面积",
        formula: "_1+_2+_3+_4+_5+_6",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/车位数",
        bases: "1:江苏嘉城/设计/产品/停车设施/架空停车楼/车位数|2:江苏嘉城/设计/产品/停车设施/架空花园/车位数|3:江苏嘉城/设计/产品/停车设施/架空车库/车位数|4:江苏嘉城/设计/产品/停车设施/地下车位(非人防)/车位数|5:江苏嘉城/设计/产品/停车设施/地下车位(人防)/车位数|6:江苏嘉城/设计/产品/停车设施/地面露天停车/车位数",
        formula: "_1+_2+_3+_4+_5+_6",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/建筑面积",
        bases: "1:江苏嘉城/设计/产品/停车设施/架空停车楼/建筑面积|2:江苏嘉城/设计/产品/停车设施/架空花园/建筑面积|3:江苏嘉城/设计/产品/停车设施/架空车库/建筑面积|4:江苏嘉城/设计/产品/停车设施/地下车位(非人防)/建筑面积|5:江苏嘉城/设计/产品/停车设施/地下车位(人防)/建筑面积|6:江苏嘉城/设计/产品/停车设施/地面露天停车/建筑面积",
        formula: "_1+_2+_3+_4+_5+_6",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/建造面积",
        bases: "1:江苏嘉城/设计/产品/停车设施/架空停车楼/建造面积|2:江苏嘉城/设计/产品/停车设施/架空花园/建造面积|3:江苏嘉城/设计/产品/停车设施/架空车库/建造面积|4:江苏嘉城/设计/产品/停车设施/地下车位(非人防)/建造面积|5:江苏嘉城/设计/产品/停车设施/地下车位(人防)/建造面积|6:江苏嘉城/设计/产品/停车设施/地面露天停车/建造面积",
        formula: "_1+_2+_3+_4+_5+_6",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/可售面积",
        bases: "1:江苏嘉城/设计/产品/停车设施/架空停车楼/可售面积|2:江苏嘉城/设计/产品/停车设施/架空花园/可售面积|3:江苏嘉城/设计/产品/停车设施/架空车库/可售面积|4:江苏嘉城/设计/产品/停车设施/地下车位(非人防)/可售面积|5:江苏嘉城/设计/产品/停车设施/地下车位(人防)/可售面积|6:江苏嘉城/设计/产品/停车设施/地面露天停车/可售面积",
        formula: "_1+_2+_3+_4+_5+_6",
        markdown: "单位:平方米"
    },

    //架空停车楼
    {
        name: "江苏嘉城/设计/产品/停车设施/架空停车楼/占地面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/架空停车楼/车位数",
        formula: "",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/架空停车楼/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/架空停车楼/建造面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/架空停车楼/可售面积",
        formula: "",
        markdown: "单位:平方米"
    },

    //架空花园
    {
        name: "江苏嘉城/设计/产品/停车设施/架空花园/占地面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/架空花园/车位数",
        formula: "",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/架空花园/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/架空花园/建造面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/架空花园/可售面积",
        formula: "",
        markdown: "单位:平方米"
    },

    //架空车库
    {
        name: "江苏嘉城/设计/产品/停车设施/架空车库/占地面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/架空车库/车位数",
        formula: "",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/架空车库/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/架空车库/建造面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/架空车库/可售面积",
        formula: "",
        markdown: "单位:平方米"
    },

    //地下车位非人防
    {
        name: "江苏嘉城/设计/产品/停车设施/地下车位(非人防)/占地面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/地下车位(非人防)/车位数",
        formula: "",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/地下车位(非人防)/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/地下车位(非人防)/建造面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/地下车位(非人防)/可售面积",
        formula: "",
        markdown: "单位:平方米"
    },

    //地下车位人防
    {
        name: "江苏嘉城/设计/产品/停车设施/地下车位(人防)/占地面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/地下车位(人防)/车位数",
        formula: "",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/地下车位(人防)/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/地下车位(人防)/建造面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/地下车位(人防)/可售面积",
        formula: "",
        markdown: "单位:平方米"
    },
    //地面露天停车
    {
        name: "江苏嘉城/设计/产品/停车设施/地面露天停车/占地面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/地面露天停车/车位数",
        formula: "",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/地面露天停车/建筑面积",
        formula: "",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/设计/产品/停车设施/地面露天停车/建造面积",
        formula: "",
        markdown: "单位:平方米"
    },

    {
        name: "江苏嘉城/设计/产品/停车设施/地面露天停车/可售面积",
        formula: "",
        markdown: "单位:平方米"
    },
];
//成本
var house = "住宅";
var houseType = ["多层住宅", "小高层住宅", "高层", "合院住宅", "情景花园"];
var costRules_住宅 = [
    //住宅
    {
        name: "江苏嘉城/成本/产品/住宅/占地面积",
        bases: "江苏嘉城/设计/产品/住宅/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/电梯台数",
        bases: "江苏嘉城/设计/产品/住宅/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/建筑面积",
        bases: "江苏嘉城/设计/产品/住宅/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/建造面积",
        bases: "江苏嘉城/设计/产品/住宅/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },

    {
        name: "江苏嘉城/成本/产品/住宅/可售面积",
        bases: "江苏嘉城/设计/产品/住宅/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/单元数",
        bases: "江苏嘉城/设计/产品/住宅/单元数",
        formula: "_1",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/户数",
        bases: "江苏嘉城/设计/产品/住宅/户数",
        formula: "_1",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/层数",
        bases: "江苏嘉城/设计/产品/住宅/层数",
        formula: "_1",
        markdown: "单位:层"
    },

    //多层住宅
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/占地面积",
        bases: "江苏嘉城/设计/产品/住宅/多层住宅/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/电梯台数",
        bases: "江苏嘉城/设计/产品/住宅/多层住宅/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/建筑面积",
        bases: "江苏嘉城/设计/产品/住宅/多层住宅/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/建造面积",
        bases: "江苏嘉城/设计/产品/住宅/多层住宅/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/可售面积",
        bases: "江苏嘉城/设计/产品/住宅/多层住宅/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/平均每户面积",
        bases: "江苏嘉城/设计/产品/住宅/多层住宅/平均每户面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/单元数",
        bases: "江苏嘉城/设计/产品/住宅/多层住宅/单元数",
        formula: "_1",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/户数",
        bases: "江苏嘉城/设计/产品/住宅/多层住宅/户数",
        formula: "_1",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/层数",
        bases: "江苏嘉城/设计/产品/住宅/多层住宅/层数",
        formula: "_1",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/层高",
        bases: "江苏嘉城/设计/产品/住宅/多层住宅/层高",
        formula: "_1",
        markdown: "单位:米"
    },
    //小高层住宅
    {
        name: "江苏嘉城/成本/产品/住宅/小高层住宅/占地面积",
        bases: "江苏嘉城/设计/产品/住宅/小高层住宅/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/小高层住宅/电梯台数",
        bases: "江苏嘉城/设计/产品/住宅/小高层住宅/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/小高层住宅/建筑面积",
        bases: "江苏嘉城/设计/产品/住宅/小高层住宅/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/小高层住宅/建造面积",
        bases: "江苏嘉城/设计/产品/住宅/小高层住宅/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/小高层住宅/可售面积",
        bases: "江苏嘉城/设计/产品/住宅/小高层住宅/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/小高层住宅/平均每户面积",
        bases: "江苏嘉城/设计/产品/住宅/小高层住宅/平均每户面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/小高层住宅/单元数",
        bases: "江苏嘉城/设计/产品/住宅/小高层住宅/单元数",
        formula: "_1",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/小高层住宅/户数",
        bases: "江苏嘉城/设计/产品/住宅/小高层住宅/户数",
        formula: "_1",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/小高层住宅/层数",
        bases: "江苏嘉城/设计/产品/住宅/小高层住宅/层数",
        formula: "_1",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/小高层住宅/层高",
        bases: "江苏嘉城/设计/产品/住宅/小高层住宅/层高",
        formula: "_1",
        markdown: "单位:米"
    },

    //高层住宅
    {
        name: "江苏嘉城/成本/产品/住宅/高层住宅/占地面积",
        bases: "江苏嘉城/设计/产品/住宅/高层住宅/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/高层住宅/电梯台数",
        bases: "江苏嘉城/设计/产品/住宅/高层住宅/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/高层住宅/建筑面积",
        bases: "江苏嘉城/设计/产品/住宅/高层住宅/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/高层住宅/建造面积",
        bases: "江苏嘉城/设计/产品/住宅/高层住宅/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/高层住宅/可售面积",
        bases: "江苏嘉城/设计/产品/住宅/高层住宅/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/高层住宅/平均每户面积",
        bases: "江苏嘉城/设计/产品/住宅/高层住宅/平均每户面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/高层住宅/单元数",
        bases: "江苏嘉城/设计/产品/住宅/高层住宅/单元数",
        formula: "_1",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/高层住宅/户数",
        bases: "江苏嘉城/设计/产品/住宅/高层住宅/户数",
        formula: "_1",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/高层住宅/层数",
        bases: "江苏嘉城/设计/产品/住宅/高层住宅/层数",
        formula: "_1",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/高层住宅/层高",
        bases: "江苏嘉城/设计/产品/住宅/高层住宅/层高",
        formula: "_1",
        markdown: "单位:米"
    },


    //合院住宅
    {
        name: "江苏嘉城/成本/产品/住宅/合院住宅/占地面积",
        bases: "江苏嘉城/设计/产品/住宅/合院住宅/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/合院住宅/电梯台数",
        bases: "江苏嘉城/设计/产品/住宅/合院住宅/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/合院住宅/建筑面积",
        bases: "江苏嘉城/设计/产品/住宅/合院住宅/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/合院住宅/建造面积",
        bases: "江苏嘉城/设计/产品/住宅/合院住宅/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/合院住宅/可售面积",
        bases: "江苏嘉城/设计/产品/住宅/合院住宅/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/合院住宅/平均每户面积",
        bases: "江苏嘉城/设计/产品/住宅/合院住宅/平均每户面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/合院住宅/单元数",
        bases: "江苏嘉城/设计/产品/住宅/合院住宅/单元数",
        formula: "_1",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/合院住宅/户数",
        bases: "江苏嘉城/设计/产品/住宅/合院住宅/户数",
        formula: "_1",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/合院住宅/层数",
        bases: "江苏嘉城/设计/产品/住宅/合院住宅/层数",
        formula: "_1",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/合院住宅/层高",
        bases: "江苏嘉城/设计/产品/住宅/合院住宅/层高",
        formula: "_1",
        markdown: "单位:米"
    },

    //情景花园
    {
        name: "江苏嘉城/成本/产品/住宅/情景花园/占地面积",
        bases: "江苏嘉城/设计/产品/住宅/情景花园/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/情景花园/电梯台数",
        bases: "江苏嘉城/设计/产品/住宅/情景花园/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/情景花园/建筑面积",
        bases: "江苏嘉城/设计/产品/住宅/情景花园/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/情景花园/建造面积",
        bases: "江苏嘉城/设计/产品/住宅/情景花园/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/情景花园/可售面积",
        bases: "江苏嘉城/设计/产品/住宅/情景花园/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/情景花园/平均每户面积",
        bases: "江苏嘉城/设计/产品/住宅/情景花园/平均每户面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/情景花园/单元数",
        bases: "江苏嘉城/设计/产品/住宅/情景花园/单元数",
        formula: "_1",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/情景花园/户数",
        bases: "江苏嘉城/设计/产品/住宅/情景花园/户数",
        formula: "_1",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/情景花园/层数",
        bases: "江苏嘉城/设计/产品/住宅/情景花园/层数",
        formula: "_1",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/情景花园/层高",
        bases: "江苏嘉城/设计/产品/住宅/情景花园/层高",
        formula: "_1",
        markdown: "单位:米"
    },


];
var costRules_经营性物业 = [
    //经营性物业
    {
        name: "江苏嘉城/成本/产品/经营性物业/占地面积",
        bases: "江苏嘉城/设计/产品/经营性物业/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/经营性物业/电梯台数",
        bases: "江苏嘉城/设计/产品/经营性物业/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/经营性物业/建筑面积",
        bases: "江苏嘉城/设计/产品/经营性物业/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/经营性物业/建造面积",
        bases: "江苏嘉城/设计/产品/经营性物业/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },

    {
        name: "江苏嘉城/成本/产品/经营性物业/可售面积",
        bases: "江苏嘉城/设计/产品/经营性物业/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    //多层住宅
    {
        name: "江苏嘉城/成本/产品/经营性物业/集中商业/占地面积",
        bases: "江苏嘉城/设计/产品/经营性物业/集中商业/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/经营性物业/集中商业/电梯台数",
        bases: "江苏嘉城/设计/产品/经营性物业/集中商业/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/经营性物业/集中商业/建筑面积",
        bases: "江苏嘉城/设计/产品/经营性物业/集中商业/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/经营性物业/集中商业/建造面积",
        bases: "江苏嘉城/设计/产品/经营性物业/集中商业/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/经营性物业/集中商业/可售面积",
        bases: "江苏嘉城/设计/产品/经营性物业/集中商业/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },

    //分散性商业
    {
        name: "江苏嘉城/成本/产品/经营性物业/分散性商业/占地面积",
        bases: "江苏嘉城/设计/产品/经营性物业/分散性商业/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/经营性物业/分散性商业/电梯台数",
        bases: "江苏嘉城/设计/产品/经营性物业/分散性商业/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/经营性物业/分散性商业/建筑面积",
        bases: "江苏嘉城/设计/产品/经营性物业/分散性商业/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/经营性物业/分散性商业/建造面积",
        bases: "江苏嘉城/设计/产品/经营性物业/分散性商业/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/经营性物业/分散性商业/可售面积",
        bases: "江苏嘉城/设计/产品/经营性物业/分散性商业/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },

];
var costRules_配套设施 = [
    //住宅
    {
        name: "江苏嘉城/成本/产品/配套设施/占地面积",
        bases: "江苏嘉城/设计/产品/配套设施/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/电梯台数",
        bases: "江苏嘉城/设计/产品/配套设施/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/建筑面积",
        bases: "江苏嘉城/设计/产品/配套设施/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/建造面积",
        bases: "江苏嘉城/设计/产品/配套设施/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },

    {
        name: "江苏嘉城/成本/产品/配套设施/可售面积",
        bases: "江苏嘉城/设计/产品/配套设施/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/单元数",
        bases: "江苏嘉城/设计/产品/配套设施/单元数",
        formula: "_1",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/户数",
        bases: "江苏嘉城/设计/产品/配套设施/户数",
        formula: "_1",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/层数",
        bases: "江苏嘉城/设计/产品/配套设施/层数",
        formula: "_1",
        markdown: "单位:层"
    },

    //多层住宅
    {
        name: "江苏嘉城/成本/产品/配套设施/幼儿园/占地面积",
        bases: "江苏嘉城/设计/产品/配套设施/幼儿园/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/幼儿园/电梯台数",
        bases: "江苏嘉城/设计/产品/配套设施/幼儿园/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/幼儿园/建筑面积",
        bases: "江苏嘉城/设计/产品/配套设施/幼儿园/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/幼儿园/建造面积",
        bases: "江苏嘉城/设计/产品/配套设施/幼儿园/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/幼儿园/可售面积",
        bases: "江苏嘉城/设计/产品/配套设施/幼儿园/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/幼儿园/平均每户面积",
        bases: "江苏嘉城/设计/产品/配套设施/幼儿园/平均每户面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/幼儿园/单元数",
        bases: "江苏嘉城/设计/产品/配套设施/幼儿园/单元数",
        formula: "_1",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/幼儿园/户数",
        bases: "江苏嘉城/设计/产品/配套设施/幼儿园/户数",
        formula: "_1",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/幼儿园/层数",
        bases: "江苏嘉城/设计/产品/配套设施/幼儿园/层数",
        formula: "_1",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/幼儿园/层高",
        bases: "江苏嘉城/设计/产品/配套设施/幼儿园/层高",
        formula: "_1",
        markdown: "单位:米"
    },
    //小高层住宅
    {
        name: "江苏嘉城/成本/产品/配套设施/会所/占地面积",
        bases: "江苏嘉城/设计/产品/配套设施/会所/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/会所/电梯台数",
        bases: "江苏嘉城/设计/产品/配套设施/会所/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/会所/建筑面积",
        bases: "江苏嘉城/设计/产品/配套设施/会所/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/会所/建造面积",
        bases: "江苏嘉城/设计/产品/配套设施/会所/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/会所/可售面积",
        bases: "江苏嘉城/设计/产品/配套设施/会所/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/会所/平均每户面积",
        bases: "江苏嘉城/设计/产品/配套设施/会所/平均每户面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/会所/单元数",
        bases: "江苏嘉城/设计/产品/配套设施/会所/单元数",
        formula: "_1",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/会所/户数",
        bases: "江苏嘉城/设计/产品/配套设施/会所/户数",
        formula: "_1",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/会所/层数",
        bases: "江苏嘉城/设计/产品/配套设施/会所/层数",
        formula: "_1",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/会所/层高",
        bases: "江苏嘉城/设计/产品/配套设施/会所/层高",
        formula: "_1",
        markdown: "单位:米"
    },

    //高层住宅
    {
        name: "江苏嘉城/成本/产品/配套设施/物业用房/占地面积",
        bases: "江苏嘉城/设计/产品/配套设施/物业用房/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/物业用房/电梯台数",
        bases: "江苏嘉城/设计/产品/配套设施/物业用房/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/物业用房/建筑面积",
        bases: "江苏嘉城/设计/产品/配套设施/物业用房/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/物业用房/建造面积",
        bases: "江苏嘉城/设计/产品/配套设施/物业用房/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/物业用房/可售面积",
        bases: "江苏嘉城/设计/产品/配套设施/物业用房/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/物业用房/平均每户面积",
        bases: "江苏嘉城/设计/产品/配套设施/物业用房/平均每户面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/物业用房/单元数",
        bases: "江苏嘉城/设计/产品/配套设施/物业用房/单元数",
        formula: "_1",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/物业用房/户数",
        bases: "江苏嘉城/设计/产品/配套设施/物业用房/户数",
        formula: "_1",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/物业用房/层数",
        bases: "江苏嘉城/设计/产品/配套设施/物业用房/层数",
        formula: "_1",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/物业用房/层高",
        bases: "江苏嘉城/设计/产品/配套设施/物业用房/层高",
        formula: "_1",
        markdown: "单位:米"
    },


    //合院住宅
    {
        name: "江苏嘉城/成本/产品/配套设施/市政公用/占地面积",
        bases: "江苏嘉城/设计/产品/配套设施/市政公用/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/市政公用/电梯台数",
        bases: "江苏嘉城/设计/产品/配套设施/市政公用/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/市政公用/建筑面积",
        bases: "江苏嘉城/设计/产品/配套设施/市政公用/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/市政公用/建造面积",
        bases: "江苏嘉城/设计/产品/配套设施/市政公用/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/市政公用/可售面积",
        bases: "江苏嘉城/设计/产品/配套设施/市政公用/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/市政公用/平均每户面积",
        bases: "江苏嘉城/设计/产品/配套设施/市政公用/平均每户面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/市政公用/单元数",
        bases: "江苏嘉城/设计/产品/配套设施/市政公用/单元数",
        formula: "_1",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/市政公用/户数",
        bases: "江苏嘉城/设计/产品/配套设施/市政公用/户数",
        formula: "_1",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/市政公用/层数",
        bases: "江苏嘉城/设计/产品/配套设施/市政公用/层数",
        formula: "_1",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/市政公用/层高",
        bases: "江苏嘉城/设计/产品/配套设施/市政公用/层高",
        formula: "_1",
        markdown: "单位:米"
    },

    //情景花园
    {
        name: "江苏嘉城/成本/产品/配套设施/小学/占地面积",
        bases: "江苏嘉城/设计/产品/配套设施/小学/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/小学/电梯台数",
        bases: "江苏嘉城/设计/产品/配套设施/小学/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/小学/建筑面积",
        bases: "江苏嘉城/设计/产品/配套设施/小学/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/小学/建造面积",
        bases: "江苏嘉城/设计/产品/配套设施/小学/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/小学/可售面积",
        bases: "江苏嘉城/设计/产品/配套设施/小学/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/小学/平均每户面积",
        bases: "江苏嘉城/设计/产品/配套设施/小学/平均每户面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/小学/单元数",
        bases: "江苏嘉城/设计/产品/配套设施/小学/单元数",
        formula: "_1",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/小学/户数",
        bases: "江苏嘉城/设计/产品/配套设施/小学/户数",
        formula: "_1",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/小学/层数",
        bases: "江苏嘉城/设计/产品/配套设施/小学/层数",
        formula: "_1",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/成本/产品/配套设施/小学/层高",
        bases: "江苏嘉城/设计/产品/配套设施/小学/层高",
        formula: "_1",
        markdown: "单位:米"
    },


];
var costRules_停车设施 = [
    //住宅
    {
        name: "江苏嘉城/成本/产品/停车设施/占地面积",
        bases: "江苏嘉城/设计/产品/停车设施/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/电梯台数",
        bases: "江苏嘉城/设计/产品/停车设施/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/建筑面积",
        bases: "江苏嘉城/设计/产品/停车设施/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/建造面积",
        bases: "江苏嘉城/设计/产品/停车设施/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },

    {
        name: "江苏嘉城/成本/产品/停车设施/可售面积",
        bases: "江苏嘉城/设计/产品/停车设施/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/单元数",
        bases: "江苏嘉城/设计/产品/停车设施/单元数",
        formula: "_1",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/户数",
        bases: "江苏嘉城/设计/产品/停车设施/户数",
        formula: "_1",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/层数",
        bases: "江苏嘉城/设计/产品/停车设施/层数",
        formula: "_1",
        markdown: "单位:层"
    },

    //多层住宅
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(人防)/占地面积",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(人防)/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(人防)/电梯台数",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(人防)/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(人防)/建筑面积",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(人防)/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(人防)/建造面积",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(人防)/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(人防)/可售面积",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(人防)/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(人防)/平均每户面积",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(人防)/平均每户面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(人防)/单元数",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(人防)/单元数",
        formula: "_1",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(人防)/户数",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(人防)/户数",
        formula: "_1",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(人防)/层数",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(人防)/层数",
        formula: "_1",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(人防)/层高",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(人防)/层高",
        formula: "_1",
        markdown: "单位:米"
    },
    //小高层住宅
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(非人防)/占地面积",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(非人防)/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(非人防)/电梯台数",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(非人防)/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(非人防)/建筑面积",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(非人防)/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(非人防)/建造面积",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(非人防)/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(非人防)/可售面积",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(非人防)/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(非人防)/平均每户面积",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(非人防)/平均每户面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(非人防)/单元数",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(非人防)/单元数",
        formula: "_1",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(非人防)/户数",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(非人防)/户数",
        formula: "_1",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(非人防)/层数",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(非人防)/层数",
        formula: "_1",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/地下车位(非人防)/层高",
        bases: "江苏嘉城/设计/产品/停车设施/地下车位(非人防)/层高",
        formula: "_1",
        markdown: "单位:米"
    },

    //高层住宅
    {
        name: "江苏嘉城/成本/产品/停车设施/架空车库/占地面积",
        bases: "江苏嘉城/设计/产品/停车设施/架空车库/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空车库/电梯台数",
        bases: "江苏嘉城/设计/产品/停车设施/架空车库/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空车库/建筑面积",
        bases: "江苏嘉城/设计/产品/停车设施/架空车库/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空车库/建造面积",
        bases: "江苏嘉城/设计/产品/停车设施/架空车库/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空车库/可售面积",
        bases: "江苏嘉城/设计/产品/停车设施/架空车库/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空车库/平均每户面积",
        bases: "江苏嘉城/设计/产品/停车设施/架空车库/平均每户面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空车库/单元数",
        bases: "江苏嘉城/设计/产品/停车设施/架空车库/单元数",
        formula: "_1",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空车库/户数",
        bases: "江苏嘉城/设计/产品/停车设施/架空车库/户数",
        formula: "_1",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空车库/层数",
        bases: "江苏嘉城/设计/产品/停车设施/架空车库/层数",
        formula: "_1",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空车库/层高",
        bases: "江苏嘉城/设计/产品/停车设施/架空车库/层高",
        formula: "_1",
        markdown: "单位:米"
    },


    //合院住宅
    {
        name: "江苏嘉城/成本/产品/停车设施/架空花园/占地面积",
        bases: "江苏嘉城/设计/产品/停车设施/架空花园/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空花园/电梯台数",
        bases: "江苏嘉城/设计/产品/停车设施/架空花园/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空花园/建筑面积",
        bases: "江苏嘉城/设计/产品/停车设施/架空花园/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空花园/建造面积",
        bases: "江苏嘉城/设计/产品/停车设施/架空花园/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空花园/可售面积",
        bases: "江苏嘉城/设计/产品/停车设施/架空花园/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空花园/平均每户面积",
        bases: "江苏嘉城/设计/产品/停车设施/架空花园/平均每户面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空花园/单元数",
        bases: "江苏嘉城/设计/产品/停车设施/架空花园/单元数",
        formula: "_1",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空花园/户数",
        bases: "江苏嘉城/设计/产品/停车设施/架空花园/户数",
        formula: "_1",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空花园/层数",
        bases: "江苏嘉城/设计/产品/停车设施/架空花园/层数",
        formula: "_1",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空花园/层高",
        bases: "江苏嘉城/设计/产品/停车设施/架空花园/层高",
        formula: "_1",
        markdown: "单位:米"
    },
    //情景花园
    {
        name: "江苏嘉城/成本/产品/停车设施/架空停车楼/占地面积",
        bases: "江苏嘉城/设计/产品/停车设施/架空停车楼/占地面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空停车楼/电梯台数",
        bases: "江苏嘉城/设计/产品/停车设施/架空停车楼/电梯台数",
        formula: "_1",
        markdown: "单位:台"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空停车楼/建筑面积",
        bases: "江苏嘉城/设计/产品/停车设施/架空停车楼/建筑面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空停车楼/建造面积",
        bases: "江苏嘉城/设计/产品/停车设施/架空停车楼/建造面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空停车楼/可售面积",
        bases: "江苏嘉城/设计/产品/停车设施/架空停车楼/可售面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空停车楼/平均每户面积",
        bases: "江苏嘉城/设计/产品/停车设施/架空停车楼/平均每户面积",
        formula: "_1",
        markdown: "单位:平方米"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空停车楼/单元数",
        bases: "江苏嘉城/设计/产品/停车设施/架空停车楼/单元数",
        formula: "_1",
        markdown: "单位:个"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空停车楼/户数",
        bases: "江苏嘉城/设计/产品/停车设施/架空停车楼/户数",
        formula: "_1",
        markdown: "单位:户"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空停车楼/层数",
        bases: "江苏嘉城/设计/产品/停车设施/架空停车楼/层数",
        formula: "_1",
        markdown: "单位:层"
    },
    {
        name: "江苏嘉城/成本/产品/停车设施/架空停车楼/层高",
        bases: "江苏嘉城/设计/产品/停车设施/架空停车楼/层高",
        formula: "_1",
        markdown: "单位:米"
    },

];

var costRules_土地费_多层住宅 = [{
        name: "江苏嘉城/成本/产品/住宅/多层住宅/土地费",
        bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/地价|2:江苏嘉城/成本/产品/住宅/多层住宅/土地有关的税费|3:江苏嘉城/成本/产品/住宅/多层住宅/土地交易服务费|4:江苏嘉城/成本/产品/住宅/多层住宅/拆迁-补偿费|5:江苏嘉城/成本/产品/住宅/多层住宅/红线外大市政配套费|6:江苏嘉城/成本/产品/住宅/多层住宅/合作款项|6:江苏嘉城/成本/产品/住宅/多层住宅/红线外大市政配套费|6:江苏嘉城/成本/产品/住宅/多层住宅/合作款项|7:江苏嘉城/成本/产品/住宅/多层住宅/其他土地费|8:江苏嘉城/成本/产品/住宅/多层住宅/预提数|江苏嘉城/成本/产品/住宅/多层住宅/红线外大市政配套费|6:江苏嘉城/成本/产品/住宅/多层住宅/结算款",
        formula: "_1+_2+_3+_4+_5+_6+_7+_8+_9",
        markdown: "单位:万元"
    },

    //地价
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/地价",
        bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/土地出让-转让-征用费|2:江苏嘉城/成本/产品/住宅/多层住宅/土地勘界费|3:江苏嘉城/成本/产品/住宅/多层住宅/土地使用费|4:江苏嘉城/成本/产品/住宅/多层住宅/超面积补交的地价|5:江苏嘉城/成本/产品/住宅/多层住宅/增容费|6:江苏嘉城/成本/产品/住宅/多层住宅/其他地价费用",
        formula: "_1+_2+_3+_4+_5+_6",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/土地出让-转让-征用费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/土地勘界费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/土地使用费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/超面积补交的地价",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/增容费",
        markdown: "单位:万元|容积率调整增加的费用"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/其他地价费用",
        markdown: "单位:万元"
    },
    //土地相关的税费
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/土地相关的税费",
        bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/土地契税|2:江苏嘉城/成本/产品/住宅/多层住宅/耕地占用税|3:江苏嘉城/成本/产品/住宅/多层住宅/土地相关的其他税费",
        formula: "_1+_2+_3",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/土地契税",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/耕地占用税",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/土地相关的其他税费",
        markdown: "单位:万元"
    },
    //土地交易服务费
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/土地交易服务费",
        markdown: "单位:万元"
    },
    //拆迁补偿费
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/拆迁-补偿费",
        bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/拆迁补偿费|2:江苏嘉城/成本/产品/住宅/多层住宅/地上|地下附属物拆除费|3:江苏嘉城/成本/产品/住宅/多层住宅/地上-地下附属物拆除费|4:青苗补偿费|5:安置费|6:其他拆迁-补偿费",
        formula: "_1+_2+_3+_4+_5+_6",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/拆迁补偿费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/地上-地下附属物拆除费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/青苗补偿费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/安置费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/其他拆迁-补偿费",
        markdown: "单位:万元"
    },
    //红线外大市政配套费
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/红线外大市政配套费",
        bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/市政配套费|2:江苏嘉城/成本/产品/住宅/多层住宅/红线外道路、水、电、气、通讯等建造费|3:江苏嘉城/成本/产品/住宅/多层住宅/接口补偿费|4:江苏嘉城/成本/产品/住宅/多层住宅/红线外景观|5:江苏嘉城/成本/产品/住宅/多层住宅/其他红线外大市政配套费",
        formula: "_1+_2+_3+_4+_5",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/市政配套费",
        bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/商业市政配套费|2:江苏嘉城/成本/产品/住宅/多层住宅/住宅市政配套费",
        formula: "_1+_2",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/商业市政配套费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/住宅市政配套费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/红线外道路、水、电、气、通讯等建造费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/接口补偿费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/红线外景观",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/其他红线外大市政配套费",
        markdown: "单位:万元"
    },
    //合作款项

    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/为获土地收购公司的费用",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/为获土地专项资本的利息",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/其他合作款项",
        markdown: "单位:万元"
    },
    //其他土地费
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/其他土地费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/预提数",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/结算款",
        markdown: "单位:万元"
    },

];

var costRules_前期工程费_报批报建费_多层住宅 = [

    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/报批报建费用",
        bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/规划费用|2:江苏嘉城/成本/产品/住宅/多层住宅/消防费用|3:江苏嘉城/成本/产品/住宅/多层住宅/人防费用|4:江苏嘉城/成本/产品/住宅/多层住宅/建设费用|5:江苏嘉城/成本/产品/住宅/多层住宅/防雷费用|6:江苏嘉城/成本/产品/住宅/多层住宅/房产测绘费|7:江苏嘉城/成本/产品/住宅/多层住宅/劳保基金|8:江苏嘉城/成本/产品/住宅/多层住宅/其他报批报建费用",
        formula: "_1+_2+_3+_4+_5+_6+_7+_8",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/规划费用",
        bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/环境评估费|2:江苏嘉城/成本/产品/住宅/多层住宅/水土保持方案技术咨询费|3:江苏嘉城/成本/产品/住宅/多层住宅/方案评审费|4:江苏嘉城/成本/产品/住宅/多层住宅/日照分析费|5:江苏嘉城/成本/产品/住宅/多层住宅/交通影响评价费|6:江苏嘉城/成本/产品/住宅/多层住宅/建设工程规划许可公示牌制作费|7:江苏嘉城/成本/产品/住宅/多层住宅/主要经济技术指标复核技术咨询费|8:江苏嘉城/成本/产品/住宅/多层住宅/网上交易信息服务费|9:江苏嘉城/成本/产品/住宅/多层住宅/放点测量费|10:江苏嘉城/成本/产品/住宅/多层住宅/综合管网测量费|11:江苏嘉城/成本/产品/住宅/多层住宅/价格调节基金|12:江苏嘉城/成本/产品/住宅/多层住宅/白蚁预防费|13:江苏嘉城/成本/产品/住宅/多层住宅/新型墙体材料发展基金|14:江苏嘉城/成本/产品/住宅/多层住宅/散装水泥发展基金|15:江苏嘉城/成本/产品/住宅/多层住宅/抗震设计审查费|16:江苏嘉城/成本/产品/住宅/多层住宅/施工图审查费|17:江苏嘉城/成本/产品/住宅/多层住宅/技术服务费|18:江苏嘉城/成本/产品/住宅/多层住宅/丘图测量费|19:江苏嘉城/成本/产品/住宅/多层住宅/测绘图资料费及复印费|20:江苏嘉城/成本/产品/住宅/多层住宅/竣工档案资料服务费|21:江苏嘉城/成本/产品/住宅/多层住宅/项目报建公示费|22:江苏嘉城/成本/产品/住宅/多层住宅/其他规划费用",
        formula: "_1+_2+_3+_4+_5+_6+_7+_8+_9+_10+_11+_12+_13+_14+_15+_16+_17+_18+_19+_20+_21+_22",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/环境评估费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/水土保持方案技术咨询费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/方案评审费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/日照分析费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/交通影响评价费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/建设工程规划许可公示牌制作费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/主要经济技术指标复核技术咨询费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/网上交易信息服务费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/放点测量费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/综合管网测量费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/价格调节基金",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/白蚁预防费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/新型墙体材料发展基金",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/散装水泥发展基金",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/抗震设计审查费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/施工图审查费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/技术服务费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/丘图测量费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/测绘图资料费及复印费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/竣工档案资料服务费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/项目报建公示费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/其他规划费用",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/消防费用",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/人防费用",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/建设费用",
        bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/安监费|2:江苏嘉城/成本/产品/住宅/多层住宅/质检费|3:江苏嘉城/成本/产品/住宅/多层住宅/考古费|4:江苏嘉城/成本/产品/住宅/多层住宅/其他建设费用"
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/安监费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/质检费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/考古费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/其他建设费用",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/防雷费用",
        bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/防雷设计审查费|2:江苏嘉城/成本/产品/住宅/多层住宅/其他防雷费用",
        formula: "_1+_2",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/防雷设计审查费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/其他防雷费用",
        markdown: "单位:万元"
    },

    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/房产测绘费",
        bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/房产面积预测费|2:江苏嘉城/成本/产品/住宅/多层住宅/房产面积实测费|3:江苏嘉城/成本/产品/住宅/多层住宅/其他房产测绘费",
        formula: "_1+_2+_3",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/房产面积预测费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/房产面积实测费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/其他房产测绘费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/劳保基金",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/其他报批报建费用",
        markdown: "单位:万元"
    },
];
var costRules_前期工程费_设计费_多层住宅 = [
    //设计费
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/设计费",
        bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/项目概念规划设计费|2:江苏嘉城/成本/产品/住宅/多层住宅/方案设计费|3:江苏嘉城/成本/产品/住宅/多层住宅/扩初设计费|4:江苏嘉城/成本/产品/住宅/多层住宅/施工图设计费|5:江苏嘉城/成本/产品/住宅/多层住宅/园林景观设计费|6:江苏嘉城/成本/产品/住宅/多层住宅/专项设计费",
        formula: "_1+_2+_3+_4+_5+_6",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/项目概念规划设计费",
        bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/项目概念规划设计招标费|2:江苏嘉城/成本/产品/住宅/多层住宅/概念规划设计费|3:其他概念规划设计费",
        formula: "_1+_2+_3",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/项目概念规划设计招标费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/概念规划设计费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/其他概念规划设计费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/方案设计费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/扩初设计费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/施工图设计费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/园林景观设计费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/专项设计费",
        bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/人防设计费|2:江苏嘉城/成本/产品/住宅/多层住宅/基坑、边坡支护设计费|3:江苏嘉城/成本/产品/住宅/多层住宅/精装设计费|4:江苏嘉城/成本/产品/住宅/多层住宅/亮化工程设计费|5:江苏嘉城/成本/产品/住宅/多层住宅/幕墙设计费|6:江苏嘉城/成本/产品/住宅/多层住宅/其他专项设计费",
        formula: "_1+_2+_3+_4+_5+_6",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/人防设计费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/基坑、边坡支护设计费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/精装设计费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/亮化工程设计费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/幕墙设计费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/其他专项设计费",
        markdown: "单位:万元"
    },

];

var costRules_前期工程费_勘测费_多层住宅 = [
    //勘测费
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/勘测费",
        bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/地质勘察费|2:江苏嘉城/成本/产品/住宅/多层住宅/地形测绘费|3:江苏嘉城/成本/产品/住宅/多层住宅/其他勘测费",
        formula: "_1+_2+_3",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/地质勘察费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/地形测绘费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/其他勘测费",
        markdown: "单位:万元"
    },
];

var costRules_前期工程费_三通一平费_多层住宅 = [{
        name: "江苏嘉城/成本/产品/住宅/多层住宅/三通一平费",
        bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/临时道路费|2:江苏嘉城/成本/产品/住宅/多层住宅/临时用电费|3:江苏嘉城/成本/产品/住宅/多层住宅/临时用水费|4:江苏嘉城/成本/产品/住宅/多层住宅/场地平整(含清表费用)|5:江苏嘉城/成本/产品/住宅/多层住宅/其他三通一平费",
        formula: "_1+_2+_3+_4+_5",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/临时道路费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/临时用电费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/临时用水",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/场地平整(含请表费用)",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/其他三通一平费",
        markdown: "单位:万元"
    },
];
var costRules_前期工程费_临时设施费_多层住宅 = [{
        name: "江苏嘉城/成本/产品/住宅/多层住宅/临时设施费",
        bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/临时围墙费|2:江苏嘉城/成本/产品/住宅/多层住宅/临时场地占用费|3:江苏嘉城/成本/产品/住宅/多层住宅/临时围板|4:江苏嘉城/成本/产品/住宅/多层住宅/临时生活用房|5:江苏嘉城/成本/产品/住宅/多层住宅/其他临时设施费",
        formula: "_1+_2+_3+_4+_5",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/临时围墙费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/临时场地占用费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/临时围板",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/临时生活用房",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/其他临时设施费",
        markdown: "单位:万元"
    },

];

var costRules_前期工程费_咨询顾问费_多层住宅 = [{
        name: "江苏嘉城/成本/产品/住宅/多层住宅/咨询顾问费",
        bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/招标代理类费用|2:江苏嘉城/成本/产品/住宅/多层住宅/土地评估费|3:江苏嘉城/成本/产品/住宅/多层住宅/土地评估费|4:江苏嘉城/成本/产品/住宅/多层住宅/其他专项类咨询委托费|5:江苏嘉城/成本/产品/住宅/多层住宅/健康住宅专项费用|6:江苏嘉城/成本/产品/住宅/多层住宅/可行性研究费|7:江苏嘉城/成本/产品/住宅/多层住宅/法律顾问费|8:江苏嘉城/成本/产品/住宅/多层住宅/建设工程交易费|9:江苏嘉城/成本/产品/住宅/多层住宅/绿色建筑创建设计与会议服务|10:江苏嘉城/成本/产品/住宅/多层住宅/其他咨询顾问费",
        formula: "_1+_2+_3+_4+_5+_6+_7+_8+_9+_10",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/招标代理类费用",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/土地评估费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/其他专项类咨询委托费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/健康住宅专项费用",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/可行性研究费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/法律顾问费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/建设工程交易费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/绿色建筑创建设计及会议服务",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/其他咨询顾问费",
        markdown: "单位:万元"
    },
];
var costRules_前期工程费_多层住宅 = [{
    name: "江苏嘉城/成本/产品/住宅/多层住宅/前期工程费",
    bases: "1:江苏嘉城/成本/产品/住宅/多层住宅/报批报建费|2:江苏嘉城/成本/产品/住宅/多层住宅/设计费|3:江苏嘉城/成本/产品/住宅/多层住宅/勘测费|4:江苏嘉城/成本/产品/住宅/多层住宅/三通一平费|5:江苏嘉城/成本/产品/住宅/多层住宅/临时设施费|6:江苏嘉城/成本/产品/住宅/多层住宅/咨询顾问费|7:江苏嘉城/成本/产品/住宅/多层住宅/预提数|8:江苏嘉城/成本/产品/住宅/多层住宅/结转数",
    formula: "_1+_2+_3+_4+_5+_6+_7+_8",
    markdown: "单位:万元"
}, ];
//建筑安装工程费
var costRules_建筑安装工程费_多层住宅 = [{
        name: "江苏嘉城/成本/产品/住宅/多层住宅/建设安装工程费",
        markdown: "单位:万元"
    },
    {
        name: "江苏嘉城/成本/产品/住宅/多层住宅/建设安装工程费",
        markdown: "单位:万元"
    },

];



/**
 * 
 * target rule
 * 
 * {
 * name:
 * bases:
 * formula:
 * }
 * target terminology
 * {name:
 * desc:{cn:,en:}
 * markdown:{unit:,explain:}
 * }
 */
const objectNamePrefix = "G";

function* ruleDefine2TerminologyAndRuleDescriptor(accessorTag, ruleDefine) {
    var _nameCn = ruleDefine.name;
    var _formula = ruleDefine.formula;
    var _bases = ruleDefine.bases;

    function* parseNameCn(nameCn) {


    }


}